#+TODO: TODO WAITING IN-PROGRESS TESTING DONE

* TODO prerequrements [2/4]
  - [ ] Richard info
  - [ ] Testserver Zugang
  - [X] David
  - [X] Git
    - new brach :: PDO 

* TODO [#A] files :: validate.php [4/9]
** DONE [#A] config.php [3/3] 
   CLOCK: [2014-02-23 Sun 17:58]--[2014-02-23 Sun 18:58] =>  1:00
   - [X] install.php :: changed & tested 
   - [X] -> config.php :: tested
   - [X] commit file 
     
** TESTING [#A] validate.php [5/7]				       :Main:
   CLOCK: [2014-03-10 Mon 20:58]--[2014-03-10 Mon 21:24] =>  0:26
   CLOCK: [2014-02-24 Mon 13:58]--[2014-02-24 Mon 15:17] =>  1:19
   CLOCK: [2014-02-23 Sun 18:55]--[2014-02-23 Sun 19:56] =>  1:01
   - [X] indexed
   - [X] SELECT [10/10]
     1. [X] #01
     2. [X] #02
     3. [X] 
     4. [X] 
     5. [X] 
     6. [X] 
     7. [X] 
     8. [X] 
     9. [X] 
     10. [X] 

   - [X] INSERT [8/8]
     1. [X] #01
     2. [X] #02
     3. [X] #03
     4. [X] #04
     5. [X] #05
	ic
     6. [X] #06
	ic
     7. [X] #07
     8. [X] #08
	ic
   - [X] DELETE [3/3]
     1. [X] #01 <2014-02-24 Mon>
     2. [X] #02
     3. [X] #03 
  	delete in comment
   - [X] UPDATE [6/6]
     1. [X] #01
     2. [X] #02
     3. [X] 
     4. [X] 
     5. [X] 
     6. [X]
   - [ ] Test

   - [ ] commit file
     
** TESTING [#B] assessmet/catscores.php [2/4]			  :Dependent:
   1. [X] index
   2. [X] SELECT
      1. [X] 
      2. [X] 
      3. [X] 
   3. [ ] commit
   4. [ ] Test

** TESTING [#B] assessment/displayq2.php [2/4]			  :Dependent:
     - [X] indexed
     - [X] SELECT [5/5]
       1. [X] 
       2. [X] 
       3. [X]
       4. [X]
       5. [X] 
     - [ ] Test
     - [ ] commit

** TESTING [#B] assessment/testutil.php [5/7]			  :Dependent:
   - [X] indexed
   - [X] SELECT [3/3]
     1. [X] 
     2. [X] SELECT#02a
     3. [X] SELECT#02b
   - [X] INSERT [1/1]
     1. [X] 
   - [X] DELETE [0/0]
     - no entries
   - [X] UPDATE [1/1]
     1. [X] 
   - [ ] commit file
   - [ ] Test

** DONE [#B] assessment/asidutil.php [2/2]			  :Dependent:
   - [X] not entries
   - [X] no includes

** DONE [#B] assessment/matphp2.php [2/2]			  :Dependent:
   - [X] not entries
   - [X] no includes
** TESTING [#B] assessment/interpret5.php [2/4]			  :Dependent:
   - [X] indexed
   - [X] SELECT [2/2]
     1. [X] 
     2. [X] 
   - [ ] commit file
   - [ ] Test

** DONE [#B] assessment/macros.php [2/2]			  :Dependent:
   - [X] not entries
   - [X] no includes

* TODO [#B] files :: assessment/showtest.php [4/11] 		       :Main:
** WAITING [#A] assessment/showtest.php [5/7] 			       :Main:
   1. [X] indexed
   2. [X] SELECT [25/25]
      1. [X] 25 Item
      2. [X] 
      3. [X] 
      4. [X] 
      5. [X] 
      6. [X] 
      7. [X] 
      8. [X] 
      9. [X] 
      10. [X] intendation problem start
      11. [X] 
      12. [X] 
      13. [X] 
      14. [X] 
      15. [X] 
      16. [X] line 1127 select#16a + 16b
      17. [X] 
      18. [X] 
      19. [X] 
      20. [X] 
      21. [X] 
      22. [X] #22 ic
      23. [X] 
      24. [X] 
      25. [X] 
   3. [X] INSERT [11/11]
      1. [X] 
      2. [X] 
      3. [X] 
      4. [X] 
      5. [X] 
      6. [X] 
      7. [X] 
      8. [X] 
      9. [X] 
      10. [X] 
      11. [X] addslashes/ stripslashes confusion line 1236 
   4. [X] DELETE [2/2]
      1. [X] 
      2. [X] 2 Item
   5. [X] UPDATE [6/6]
      1. [X] 
      2. [X] 
      3. [X] line 603
      4. [X] 
      5. [X] 
      6. [X] ic 6 Item
   6. [ ] commit file
   7. [ ] Test
  

** TODO [3/3] QA 
  - [X] 'fetch-lazy' :: validieren
  - [X] 'fetch-named' :: validieren
  - [X] 'fetch-column' :: validieren
* TODO [#C] files :: assessment/printtest.php [0/1] 		       :Main:
** TODO [#C] assessment/printtest.php [3/7] 			       :Main:
   - [ ] indexed
   - [ ] SELECT [0/2]
     1. [ ] 
     2. [ ]
   - [X] INSERT [0/0]
   - [X] DELETE [0/0]
   - [X] UPDATE [0/0]
   - [ ] commit file
   - [ ] Test
* TODO [3/3] QA 
  - [X] 'fetch-lazy' :: validieren
  - [X] 'fetch-named' :: validieren
  - [X] 'fetch-column' :: validieren
* DONE [#A] misc [1/1]
  CLOSED: [2014-03-21 Fri 16:19] SCHEDULED: <2014-03-21 Fri>
  - [X] DebugPDO.php :: PDODumpArrayAsTable

